# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Brian\Dropbox\RPiSoC\Projects\PSoC_2_Pi\Wavedac_test.cydsn\Wavedac_test.cyprj
# Date: Sun, 03 Aug 2014 02:38:14 GMT
#set_units -time ns
create_clock -name {WaveDAC_clk(routed)} -period 4166.6666666666661 -waveform {0 2083.33333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {WaveDAC_clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 101 201} -nominal_period 4166.6666666666661 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {SPIS_1_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 13 25} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Brian\Dropbox\RPiSoC\Projects\PSoC_2_Pi\Wavedac_test.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Brian\Dropbox\RPiSoC\Projects\PSoC_2_Pi\Wavedac_test.cydsn\Wavedac_test.cyprj
# Date: Sun, 03 Aug 2014 02:37:54 GMT
